In [1]:
from sqlalchemy import create_engine, text
import pandas as pd
import numpy as np

engine = create_engine('mysql+pymysql://root:root1234@localhost')

In [2]:
def get_query_result(query):
    with engine.connect() as connection:
        trans = connection.begin()
        try:
            if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
                query = text(query)
                result = pd.read_sql(query, connection)
                print("Query executed successfully and returned data.")
                return result
            else:
                query = text(query)
                result = connection.execute(query)
                trans.commit()  # Commit the transaction for non-select queries
                print("Query executed successfully")
                print("Rowcount:", result.rowcount)
                print("Returns Rows:", result.returns_rows)
                return result
        except Exception as e:
            trans.rollback()
            print(f"Query execution failed: {str(e)}")
            return None

In [3]:
query = """
show databases;
"""
get_query_result(query)

Query executed successfully and returned data.

             Database
0  information_schema
1          leadsource
2     leadsource_test
3               mysql
4  performance_schema
5        sql_practice
6                 sys
7        wordpress_db

In [4]:
query = """
use sql_practice;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [5]:
query = """
show tables;
"""
get_query_result(query)

Query executed successfully and returned data.

  Tables_in_sql_practice
0                  books
1             palindrome

In [6]:
query = """
select * from books;
"""
get_query_result(query)

Query executed successfully and returned data.

,book_id,title,author_last_name,release_year,stock_quantity,pages,author_first_name
0,1,The Namesake,Lahiri,2003,32,291,Jhumpa
1,2,Norse Mythology,Gaiman,2016,43,304,Neil
2,3,American Gods,Gaiman,2001,12,465,Neil
3,4,Interpreter of Maladies,Lahiri,1996,97,198,Jhumpa
4,5,A Hologram for the King: A Novel,Eggers,2012,154,352,Dave
5,6,The Circle,Eggers,2013,26,504,Dave
6,7,The Amazing Adventures of Kavalier & Clay,Chabon,2000,68,634,Michael
7,8,Just Kids,Smith,2010,55,304,Patti
8,9,A Heartbreaking Work of Staggering Genius,Eggers,2001,104,437,Dave
9,10,Coraline,Gaiman,2003,100,208,Neil
10,11,What We Talk About When We Talk About Love: St...,Carver,1981,23,176,Raymond
11,12,Where I'm Calling From: Selected Stories,Carver,1989,12,526,Raymond
12,13,White Noise,DeLillo,1985,49,320,Don
13,14,Cannery Row,Steinbeck,1945,95,181,John
14,15,Oblivion: Stories,Foster Wallace,2004,172,329,David
15,16,Consider the Lobster,Foster Wallace,2005,92,343,David

In SQL, relationships between tables are established to maintain the integrity and consistency of data. The most common relationships in relational databases are **one-to-one**, **one-to-many**, and **many-to-many**. These relationships are usually enforced using **foreign keys**.

### **Types of Relationships**

1. **One-to-One (1:1) Relationship**
2. **One-to-Many (1:N) Relationship**
3. **Many-to-Many (M:N) Relationship**

#### 1. **One-to-One (1:1) Relationship**

In a one-to-one relationship, a record in one table corresponds to exactly one record in another table. This type of relationship is less common and is often used when you want to split a table for performance reasons or to store optional data in a separate table.

**Example:**
- **Tables:** `employees` and `employee_details`
- **Relationship:** Each employee has one unique set of detailed information.

**SQL Example:**

```sql
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    name VARCHAR(100)
);

CREATE TABLE employee_details (
    detail_id INT PRIMARY KEY,
    employee_id INT UNIQUE,
    address VARCHAR(255),
    phone_number VARCHAR(15),
    FOREIGN KEY (employee_id) REFERENCES employees(employee_id)
);
```

- **Explanation:** `employee_details` has a `UNIQUE` constraint on `employee_id` to ensure each employee has only one set of details.

#### 2. **One-to-Many (1:N) Relationship**

In a one-to-many relationship, a record in one table can correspond to multiple records in another table. This is the most common type of relationship.

**Example:**
- **Tables:** `departments` and `employees`
- **Relationship:** Each department has multiple employees, but each employee belongs to only one department.

**SQL Example:**

```sql
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(100)
);

CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    name VARCHAR(100),
    department_id INT,
    FOREIGN KEY (department_id) REFERENCES departments(department_id)
);
```

- **Explanation:** The `employees` table contains a `department_id` that references the `department_id` in the `departments` table.

#### 3. **Many-to-Many (M:N) Relationship**

In a many-to-many relationship, multiple records in one table can correspond to multiple records in another table. This type of relationship is usually implemented using a **junction table** (also called a **join table** or **link table**).

**Example:**
- **Tables:** `students`, `courses`, and `enrollments`
- **Relationship:** Each student can enroll in multiple courses, and each course can have multiple students.

**SQL Example:**

```sql
CREATE TABLE students (
    student_id INT PRIMARY KEY,
    student_name VARCHAR(100)
);

CREATE TABLE courses (
    course_id INT PRIMARY KEY,
    course_name VARCHAR(100)
);

CREATE TABLE enrollments (
    student_id INT,
    course_id INT,
    PRIMARY KEY (student_id, course_id),
    FOREIGN KEY (student_id) REFERENCES students(student_id),
    FOREIGN KEY (course_id) REFERENCES courses(course_id)
);
```

- **Explanation:** The `enrollments` table is a junction table that links `students` and `courses`. The `PRIMARY KEY` on `(student_id, course_id)` ensures that each student-course pair is unique.

### **Foreign Keys**

- **Foreign Key (FK):** A foreign key is a column (or set of columns) that establishes a link between data in two tables. The foreign key in one table points to the primary key in another table, ensuring referential integrity.
- **Referential Integrity:** This ensures that a foreign key value always refers to an existing record in the parent table. If a record in the parent table is deleted or updated, the corresponding child records may be affected depending on the foreign key's settings (e.g., `ON DELETE CASCADE`).

**Foreign Key Example:**

```sql
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_date DATE,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
    ON DELETE CASCADE
    ON UPDATE CASCADE
);
```

- **Explanation:** If a customer is deleted from the `customers` table, the `ON DELETE CASCADE` will automatically delete all related orders from the `orders` table.

### **Summary**

- **One-to-One:** Use when each record in a table corresponds to exactly one record in another table.
- **One-to-Many:** Use when a record in one table can have multiple related records in another table.
- **Many-to-Many:** Use a junction table to handle relationships where multiple records in one table can relate to multiple records in another table.
- **Foreign Keys:** Enforce relationships between tables and ensure referential integrity.

These relationships are fundamental to designing a normalized database structure that maintains data consistency and integrity.

## `cross join`

A **CROSS JOIN** in SQL is a type of join that returns the Cartesian product of the two tables involved. This means that every row from the first table is combined with every row from the second table. A CROSS JOIN doesn't require a condition (such as ON or WHERE) to join the tables.

### **Key Characteristics of CROSS JOIN:**

- **Cartesian Product:** If the first table has `m` rows and the second table has `n` rows, the result will have `m * n` rows.
- **No Condition Required:** Unlike other types of joins, a CROSS JOIN does not require a condition to join the tables.

### **Syntax:**

```sql
SELECT *
FROM table1
CROSS JOIN table2;
```

- **Alternative Syntax:**
  ```sql
  SELECT *
  FROM table1, table2;
  ```
  - This is the implicit syntax, where simply listing two tables in the `FROM` clause without a `WHERE` condition will result in a CROSS JOIN.

### **Example:**

Let's say we have two tables:

**Table: `products`**

| product_id | product_name |
|------------|--------------|
| 1          | Laptop       |
| 2          | Smartphone   |

**Table: `colors`**

| color_id | color_name |
|----------|------------|
| 1        | Red        |
| 2        | Blue       |

If we perform a CROSS JOIN on these tables:

```sql
SELECT *
FROM products
CROSS JOIN colors;
```

**Result:**

| product_id | product_name | color_id | color_name |
|------------|--------------|----------|------------|
| 1          | Laptop       | 1        | Red        |
| 1          | Laptop       | 2        | Blue       |
| 2          | Smartphone   | 1        | Red        |
| 2          | Smartphone   | 2        | Blue       |

- **Explanation:** Every product is combined with every color, resulting in 4 rows in the result set.

### **Use Cases for CROSS JOIN:**

1. **All Possible Combinations:** When you need to generate all possible combinations of rows from two tables.
2. **Cartesian Product:** Useful in scenarios like creating test data or performing combinatorial operations.

### **Performance Considerations:**

- **Large Tables:** Be cautious when using CROSS JOIN with large tables, as the result set can grow exponentially, leading to performance issues and potentially overwhelming the database.
- **Filtering:** Often, a CROSS JOIN is followed by a `WHERE` clause to filter down the result set.

### **Practical Example:**

Suppose you want to generate all combinations of a set of sizes and colors for a product:

**Table: `sizes`**

| size_id | size_name |
|---------|-----------|
| 1       | Small     |
| 2       | Medium    |
| 3       | Large     |

**Table: `colors`**

| color_id | color_name |
|----------|------------|
| 1        | Red        |
| 2        | Green      |
| 3        | Blue       |

**CROSS JOIN Example:**

```sql
SELECT s.size_name, c.color_name
FROM sizes s
CROSS JOIN colors c;
```

**Result:**

| size_name | color_name |
|-----------|------------|
| Small     | Red        |
| Small     | Green      |
| Small     | Blue       |
| Medium    | Red        |
| Medium    | Green      |
| Medium    | Blue       |
| Large     | Red        |
| Large     | Green      |
| Large     | Blue       |

This query creates a list of all possible size and color combinations.

### **Conclusion:**

A CROSS JOIN is a powerful tool for generating all combinations of rows between two tables, but it should be used with care due to the potential size of the resulting dataset.

In [7]:
query = """
create table customers(
    id int primary key auto_increment not null,
    name varchar(100)
);
"""

get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [9]:
query = """
desc customers;

"""

get_query_result(query)

Query executed successfully and returned data.

  Field          Type Null  Key Default           Extra
0    id           int   NO  PRI    None  auto_increment
1  name  varchar(100)  YES         None

In [11]:
query = """
create table orders(
    id int primary key auto_increment not null,
    code varchar(100),
    customer_id int,
    foreign key (customer_id) references customers(id)
);
"""

get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [32]:
query = """
alter table orders
add
(
amount decimal(4,2),
created date
);
"""

get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [37]:
query = """
alter table orders
modify
created datetime default CURRENT_TIMESTAMP
"""

get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [38]:
query = """
ALTER TABLE orders
ADD updated DATETIME DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [12]:
query = """
insert into customers(name)
values 
('John Doe'),
('Jane Smith'),
('Michael Johnson');
"""

get_query_result(query)

Query executed successfully
Rowcount: 3
Returns Rows: False

In [13]:
query = """
select * from customers;
"""

get_query_result(query)

Query executed successfully and returned data.

   id             name
0   1         John Doe
1   2       Jane Smith
2   3  Michael Johnson

In [15]:
query = """
insert into orders (code,customer_id)
values 
("dsfvcs",1),
("dsfvc3d",1),
("dsfvcdas",3);
"""

get_query_result(query)

Query executed successfully
Rowcount: 3
Returns Rows: False

In [16]:
query = """
select * from customers,orders
"""

get_query_result(query)

Query executed successfully and returned data.

   id             name  id      code  customer_id
0   3  Michael Johnson   1    dsfvcs            1
1   2       Jane Smith   1    dsfvcs            1
2   1         John Doe   1    dsfvcs            1
3   3  Michael Johnson   2   dsfvc3d            1
4   2       Jane Smith   2   dsfvc3d            1
5   1         John Doe   2   dsfvc3d            1
6   3  Michael Johnson   3  dsfvcdas            3
7   2       Jane Smith   3  dsfvcdas            3
8   1         John Doe   3  dsfvcdas            3

In [17]:
query = """
select * from orders
"""

get_query_result(query)

Query executed successfully and returned data.

   id      code  customer_id
0   1    dsfvcs            1
1   2   dsfvc3d            1
2   3  dsfvcdas            3

In [18]:
query = """
select * from customers
join orders
on customers.id = orders.customer_id;
"""

get_query_result(query)

Query executed successfully and returned data.

   id             name  id      code  customer_id
0   1         John Doe   1    dsfvcs            1
1   1         John Doe   2   dsfvc3d            1
2   3  Michael Johnson   3  dsfvcdas            3

In [19]:
query = """
select * from orders
join customers
on customers.id = orders.customer_id;
"""

get_query_result(query)

Query executed successfully and returned data.

   id      code  customer_id  id             name
0   1    dsfvcs            1   1         John Doe
1   2   dsfvc3d            1   1         John Doe
2   3  dsfvcdas            3   3  Michael Johnson

In [20]:
query = """
select * from orders
inner join customers
on customers.id = orders.customer_id;
"""

get_query_result(query)

Query executed successfully and returned data.

   id      code  customer_id  id             name
0   1    dsfvcs            1   1         John Doe
1   2   dsfvc3d            1   1         John Doe
2   3  dsfvcdas            3   3  Michael Johnson

In [29]:
query = """
select code from orders
inner join customers
on customers.id = orders.customer_id
group by code
"""

get_query_result(query)

Query executed successfully and returned data.

       code
0    dsfvcs
1   dsfvc3d
2  dsfvcdas

In [34]:
query = """
truncate table orders;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [ ]:
query = """
truncate table orders;
"""
get_query_result(query)

In [35]:
query = """
select * from orders;
"""
get_query_result(query)

Query executed successfully and returned data.

Empty DataFrame
Columns: [id, code, customer_id, amount, created]
Index: []

In [40]:
query = """
insert into orders(code,customer_id,amount)
values 
("1234567890",1,10),
("1234567891",2,20),
("1234567892",3,30);

"""
get_query_result(query)

Query executed successfully
Rowcount: 3
Returns Rows: False

In [41]:
query = """
select * from orders

"""
get_query_result(query)

Query executed successfully and returned data.

   id        code  customer_id  amount             created             updated
0   1  1234567890            1    10.0 2024-08-26 23:40:20 2024-08-26 23:40:20
1   2  1234567891            2    20.0 2024-08-26 23:40:20 2024-08-26 23:40:20
2   3  1234567892            3    30.0 2024-08-26 23:40:20 2024-08-26 23:40:20

In [54]:
query = """
SELECT name, code, SUM(amount) AS total, orders.created
FROM customers
INNER JOIN orders ON customers.id = orders.customer_id
GROUP BY name, code,orders.created
order by orders.created

"""
get_query_result(query)

Query executed successfully and returned data.

              name        code  total             created
0         John Doe  1234567890   10.0 2024-08-26 23:40:20
1       Jane Smith  1234567891   20.0 2024-08-26 23:40:20
2  Michael Johnson  1234567892   30.0 2024-08-26 23:40:20

In [60]:
query = """
SELECT name, orders.created
FROM customers
LEFT JOIN orders ON customers.id = orders.customer_id

"""
get_query_result(query)

Query executed successfully and returned data.

              name             created
0         John Doe 2024-08-26 23:40:20
1       Jane Smith 2024-08-26 23:40:20
2  Michael Johnson 2024-08-26 23:40:20
3           vikram                 NaT

In [57]:
query = """
insert into customers (name)
values 
("vikram");

"""
get_query_result(query)

Query executed successfully
Rowcount: 1
Returns Rows: False